app/controllers/products_controller.rb

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
---
  def show
    # productsテーブルから該当するidの作品情報を取得し@productの変数へ代入する処理を書いて下さい# 問題3ではこのコードは消して新しくコードを書いてください
    @product = Product.find(params[:id])