app/controllers/reviews_controller.rb

  def create
    Review.create(create_params)
---
INSERT INTO `reviews` (`rate`, `review`, `product_id`, `nickname`, `created_at`, `updated_at`) VALUES (1, 'いいね', 3, 'waeoi', '2017-06-29 04:03:42', '2017-06-29 04:03:42')